[{
  "name": "Jin Yong",
  "about": "Louis Cha Leung-yung[2] GBM OBE (6 February 1924 – 30 October 2018),[3][4] better known by his pen name Jin Yong (Chinese: 金庸), was a Chinese wuxia (\"martial arts and chivalry\") novelist and essayist who co-founded the Hong Kong daily newspaper Ming Pao in 1959 and served as its first editor-in-chief. He was Hong Kong's most famous writer,[5] and is named along with Gu Long and Liang Yusheng as the \"Three Legs of the Tripod of Wuxia\".",
  "imageName": "62607e3eeb6cbfce13a5cdbe398bde37"
},{
  "name": "Edgar Wallace ",
  "about": "Richard Horatio Edgar Wallace (1 April 1875 – 10 February 1932) was a British writer.  Born into poverty as an illegitimate London child, Wallace left school at the age of 12. He joined the army at age 21 and was a war correspondent during the Second Boer War for Reuters and the Daily Mail. Struggling with debt, he left South Africa, returned to London, and began writing thrillers to raise income, publishing books including The Four Just Men (1905). Drawing on his time as a reporter in the Congo, covering the Belgian atrocities, Wallace serialized short stories in magazines such as The Windsor Magazine and later published collections such as Sanders of the River (1911). He signed with Hodder and Stoughton in 1921 and became an internationally recognized author.",
  "imageName": "dfb2ef7564631cdd4b4c47818391b1b6"
},{
  "name": "Friedrich Nietzsche",
  "about": "Friedrich Nietzsche, (born October 15, 1844, Röcken, Saxony, Prussia [Germany]—died August 25, 1900, Weimar, Thuringian States) was, a German classical scholar, philosopher, and critic of culture, who became one of the most influential of all modern thinkers.",
  "imageName": "26b233c265f4e6666363e4ce23a2966c"
},{
  "name": "Anne Rice",
  "about": "Anne Rice (born Howard Allen Frances O'Brien; October 4, 1941 – December 11, 2021) was an American author of gothic fiction, erotic literature, and Christian literature. She was best known for her series of novels The Vampire Chronicles. The first book became the subject of a film adaptation—Interview with the Vampire (1994).",
  "imageName": "1bbffa4e76c4446b2e166eb2b5a080ff"
},{
  "name": "William Shakespeare",
  "about": "William Shakespeare (bapt. 26[a] April 1564 – 23 April 1616)[b] was an English playwright, poet, and actor. He is regarded as the greatest writer in the English language and the world's pre-eminent dramatist.[3][4][5] He is often called England's national poet and the \"Bard of Avon\" (or simply \"the Bard\").[6][c] His extant works, including collaborations, consist of some 39 plays, 154 sonnets, three long narrative poems, and a few other verses, some of the uncertain authorship. His plays have been translated into every major living language and are performed more often than those of any other playwright.[8] He remains arguably the most influential writer in the English language, and his works continue to be studied and reinterpreted.",
  "imageName": "a99032da7da534e8a309c4c4b865ce4b"
},{
  "name": "Eiichiro Oda",
  "about": "Eiichiro Oda, born January 1, 1975 in Kumamoto City, Kumamoto Prefecture in Japan, is a professional mangaka, best known as the creator of the manga One Piece.",
  "imageName": "970be8717966170f41520752e0652a81"
},{
  "name": "Stephenie Meyer",
  "about": "Stephenie Meyer (born December 24, 1973) is an American novelist and film producer. She is best known for writing the vampire romance series Twilight, which has sold over 160 million copies, with translations into 37 different languages. Meyer was the bestselling author of 2008 and 2009 in the U.S., having sold over 29 million books in 2008[1] and 26.5 million in 2009.[2] Meyer received the 2009 Children's Book of the Year award from the British Book Awards for Breaking Dawn, the Twilight series finale.",
  "imageName": "0f640f575bf28fa032d37c467276aa8d"
},{
  "name": "J.K.Rowling",
  "about": "Joanne Rowling was born on 31st July 1965 at Yate General Hospital near Bristol, and grew up in Gloucestershire in England and in Chepstow, Gwent, in south-east Wales.",
  "imageName": "517f064c59892c7a4ef6aefa13196a7c"
}]